---
layout: page
title:
  en: Motivation
  fr: Motivations
boxes:
    frames:
        - title:
            en: Motivation
            fr: Motivations
          text:
            en: |
             Over the past thirty years, the level of computer programming experience of students has fallen, owing to closed devices and a lack of easy access to development environments.
             
             At home, there might be a tablet or smart phone; at school, pupils are required to edit text or surf the web, but may avoid computer programming altogether.
             
             Often undergraduate or masters students have a poor level of computer knowledge.&nbsp; This prevents them from being effective at particle physics research, 
             which involves many types of computer programming activities. It also prevents them from being effective in many different commercial sectors that rely on computer programming.
             
             The [Raspberry Pi](http://www.raspberrypi.org) is an inexpensive ARM-based PC that can run LINUX and other operating systems.&nbsp; 
             Due to its low cost and flexibility, it is an ideal tool for many programming or electronics projects.&nbsp; Thanks to the large community backing its development, it's an ideal tool
             to initiate students to science and programming, and support educators in disseminating knowledge in an interactive and engaging manner.
            fr: |
             Ces trentes derni&egrave;res ann&eacute;es, le niveau d'experience en programmation des etudiants a chut&eacute;, d&ucirc; &agrave; la propagation de technologies propri&eacute;taires et le manque 
             d'environnements de d&eacute;veloppement abordables et simples.
             
             A la maison, il peut y avoir une tablette ou un t&eacute;l&eacute;phone connect&eacute;; &agrave; l'&eacute;cole les &eacute;l&egrave;ves peuvent avoir &agrave; &eacute;diter du texte ou naviguer sur le Web, mais ils peuvent
             ne pas du tout &ecirc;tre expos&eacute;s &agrave; la programmation.
             
             Souvent les diplom&eacute;s d'universit&eacute; ont un niveau faible en informatique. Cela les emp&ecirc;che de devenir efficaces rapidement dans le domaine de la recherche en physique
             des particules, qui implique plusieurs types d'activit&eacute;s li&eacute;es &agrave; la programmation et l'automatisation. Cela emp&ecirc;che aussi leur int&eacute;gration dans des domaines
             commerciaux qui n&eacute;cessitent de la programmation.
             
             Le [Raspberry Pi](http://www.raspberrypi.org) est un ordinateur personnel et peu on&eacute;reux bas&eacute; sur le processeur ARM, il peut ex&eacute;cuter Linux mais
             aussi d'autres syst&egrave;mes d'exploitation tels que Windows 10 (IoT Edition).
             Gr&acirc;ce &agrave; son faible co&ucirc;t et sa flexibilit&eacute;, il repr&eacute;sente un outil id&eacute;al pour de nombreux projets de programmation ou d'&eacute;lectronique. Gr&acirc;ce &agrave; la nombreuse communaut&eacute; supportant son
             d&eacute;veloppement, il permet d'initier les &eacute;tudiants en science et en informatique, et de soutenir les enseignants dans la diss&eacute;mination de connaissance d'une mani&egrave;re interactive et motivante.

---
